[Demo_Tutorial_HeroineDokidoki GG2CollectionDemoScript]
DemoScripts[0]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[2]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[3]=(Actor=TUT_TEXTURE,Command=START,CId=6,Bit=0)
DemoScripts[4]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Ekoro.GG2_BGM_DM_Usual_Ekoro_Cue')
DemoScripts[5]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[6]=(Actor=FADE,Command=WAIT)
DemoScripts[7]=(Actor=WINDOW,Command=SET)
DemoScripts[8]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[9]=(Actor=TUT_TEXTURE,Command=SET,CId=1,Bit=1)
DemoScripts[10]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[13]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=2,Bit=2)
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[18]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=3,Bit=3)
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[24]=(Actor=SELECT,Command=SET,ID=SELECT00)
DemoScripts[25]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[26]=(Actor=WINDOW,Command=EXIT)
DemoScripts[27]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[28]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[29]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[30]=(Actor=SYSTEM,Command=END)

[Select_Tutorial_HeroineDokidoki GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=2,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Tutorial_HeroineDokidoki GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="終於到了這個時候呢....../n這就是贏得她芳心的最後儀式,/n最終心跳模式!")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="要重複進行放大&射擊/n以心跳量值MAX為目標./n說不定會因此左右這之後的結局......",Format[0]=(Color=0xFF99CC,Start=0,End=7))

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="首先可以用L操控搖桿的/n上下左右選擇部位.")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="長按R鍵會開始放大/n放開按鍵就會施放射擊!")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="射擊命中後心跳量值會上升!/n放大的程度越高,/n量值的提升量就會越顯著.",Format[0]=(Color=0xFF99CC,Start=21,End=44))

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="但是請特別注意./n放大過頭的話/n女生會進入防禦狀態.",Format[0]=(Color=0xFF99CC,Start=13,End=29))

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="受到防禦的部位/n會暫時無法瞄準./n正所謂欲速則不達呢.")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="心跳量值累積到一定程度後,/n和女孩子的距離會變得更近.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="距離變得越近,/n就可以選擇越多/n原本藏起來的狂熱部位.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="越是狂熱的部位/n越有可能是女孩子的敏感部位./n請盡力瞄準吧!")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="一旦心跳量值到達MAX,/n就能按X鍵(心跳模式鍵)/n讓女孩子昇天.")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="峯大大人,這是最後的機會了./n請讓她神魂顛倒四肢無力到/n忍不住想要雙手比YA吧!")

Texts[12]=(Label="",Name="",Text="")

Texts[13]=(Label="SELECT01",Name="",Text="重來一次")

Texts[14]=(Label="SELECT02",Name="",Text="沒問題了")

Texts[15]=(Label="SELECT03",Name="",Text="")

Texts[16]=(Label="SELECT04",Name="",Text="")

Texts[17]=(Label="SELECT05",Name="",Text="")

Texts[18]=(Label="SELECT06",Name="",Text="")

Texts[19]=(Label="SELECT07",Name="",Text="")

Texts[20]=(Label="SELECT08",Name="",Text="")

Texts[21]=(Label="SELECT09",Name="",Text="")

Texts[22]=(Label="SELECT10",Name="",Text="")


